app/Models/ModelAnggota.php

    public function ProfileAnggota($id_anggota)
    {
        return $this->db->table('tbl_anggota')
        ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_anggota.id_prodi')
        ->where('id_anggota', $id_anggota)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_anggota`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_anggota`.`id_prodi`
WHERE `id_anggota` = '5'