app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '1234'
---
    public function LoginUser($email, $password)
    {
        return $this->db->table('tbl_user')
        ->where([
            'email' => $email,
            'password' => $password,
        ])->get()->getRowArray();

INSERT INTO `tbl_anggota` (`id_prodi`, `nim`, `nama_anggota`, `jenis_kelamin`, `email`, `no_hp`, `password`, `verifikasi`) VALUES ('6', '433785520122018', 'dylan', 'Laki-laki', 'dylan@gmaul.com', '081369766455', '33333', '0')
---
    public function Daftar($data)
    {
        $this->db->table('tbl_anggota')->insert($data);

SELECT *
FROM `tbl_anggota`
WHERE `nim` = '433785520122002'
AND `password` = '12345'
---
    public function LoginAnggota($nim, $password)
    {
        return $this->db->table('tbl_anggota')
        ->where([
            'nim' => $nim,
            'password' => $password,
        ])->get()->getRowArray();